export type FAQDataItemType = {
    id: string;
    question: string;
    answer: string;
};

export const FAQData: FAQDataItemType[] = [
    {
        id: "01",
        question: "Чи потрібні мені попередні знання для проходження курсу?",
        answer: "Ні, курс &quot;Сам собі монтажер: від аматора до професіонала&quot; розроблений для новачків. Уроки починаються з основ і поступово переходять до більш просунутих технік, тому ви зможете легко освоїти відеомонтаж без попереднього досвіду.",
    },
    {
        id: "02",
        question: "Яке програмне забезпечення використовується в курсі?",
        answer: "У курсі ми використовуємо безкоштовну програму VN для відеомонтажу. Вона проста у використанні і підходить як для початківців, так і для більш досвідчених користувачів.",
    },
    {
        id: "03",
        question: "Чи є відеоінструкції до кожного уроку?",
        answer: "Так, кожен урок включає детальні відеоінструкції до кожної дії. Це допомагає краще зрозуміти матеріал і застосувати знання на практиці.",
    },
    {
        id: "04",
        question:
            "Що робити, якщо у мене виникнуть питання під час проходження курсу?",
        answer: "Ви можете звернутися до нашої підтримки або приєднатися до спільноти студентів курсу, де ви зможете отримати допомогу та обмінятися досвідом з іншими учасниками.",
    },
    {
        id: "05",
        question: "Чи можу я переглядати уроки кілька разів?",
        answer: "Так, ви матимете доступ до всіх уроків курсу і зможете переглядати їх стільки разів, скільки вам потрібно для повного освоєння матеріалу. ",
    },
    {
        id: "06",
        question: "Чи можу я отримати сертифікат про проходження курсу?",
        answer: "Так, після успішного завершення всіх уроків і практичних завдань ви отримаєте сертифікат про проходження курсу, який підтверджує ваші навички у відеомонтажі.",
    },
];
